#+TITLE: looking-glass

Compositional profunctor optics for Emacs Lisp.

~looking-glass~ gives you one language for reading, transforming, and reviewing data across lists, vectors, plists/alists/hash tables, strings, JSON text, buffers, and regex matches.

- Express nested edits once, then reuse safely.
- Use the same combinators for pure data and effectful buffer updates.

* Quick examples

** Promote names inside JSON text (no parser boilerplate)

#+begin_src emacs-lisp
(require 'looking-glass)

(let ((json "{\"user\":{\"name\":\"Ada\"},\"active\":true}"))
  (lg-over (lg-compose lg-json-parse
                       (lg-ix "user")
                       (lg-ix "name"))
           #'upcase
           json))
;; => "{\"user\":{\"name\":\"ADA\"},\"active\":true}"
#+end_src

#+RESULTS:
: {"user":{"name":"ADA"},"active":true}

** Bulk rewrite only capture groups

#+begin_src emacs-lisp
(require 'looking-glass)
(require 'looking-glass-regex)

(lg-over (lg-compose (lg-regex-all-groups "id=\\([0-9]+\\)" 1)
                     lg-number-string)
         (apply-partially #'+ 100)
         "id=1 id=22 id=333")
;; => "id=101 id=122 id=433"
#+end_src

#+RESULTS:
: id=101 id=122 id=433

** Effect-safe buffer edits in one program

#+begin_src emacs-lisp
(require 'looking-glass)
(require 'looking-glass-buffer)
(require 'looking-glass-regex)

(let* ((upcase-hello
        (lg-effect-over-of (lg-compose lg-buffer-string
                                       (lg-regex-match "hello"))
                           #'upcase))
       (set-double-ell
        (lg-effect-set-of (lg-compose lg-buffer-string
                                      (lg-regex-match "LL" :case-fold nil))
                          "11")))
  (list
   (with-temp-buffer
     (insert "hello world")
     (lg-run-effect (lg-effect-bind upcase-hello
                                    (cl-constantly set-double-ell))
                    (current-buffer))
     (buffer-string))
   (with-temp-buffer
     (insert "hello world")
     (lg-run-effect (lg-effect-bind set-double-ell
                                    (cl-constantly upcase-hello))
                    (current-buffer))
     (buffer-string))))
;; => ("HE11O world" "HELLO world")
#+end_src

#+RESULTS:
: ("HE11O world" "HELLO world")

* Package map

- `looking-glass.el`: optic core, composition, folds, indexed optics, reviews, and law-aligned primitives.
- `looking-glass-buffer.el`: optics for point/mark/buffer text/region/substring, plus effect dispatch for buffer mutation.
- `looking-glass-regex.el`: regex and text traversals (`lg-regex-all`, `lg-lined`, `lg-utf8`).
- `laws.org`: law expectations and nil-disambiguation notes.

* Documentation

- Core manual: `doc/looking-glass-manual.org`
- Buffer manual: `doc/looking-glass-buffer-manual.org`
- Regex manual: `doc/looking-glass-regex-manual.org`

These are org-mode manuals intended for Texinfo/Info export.

* MELPA manual publishing

MELPA packages repository contents from the selected branch/commit. It does not build manuals from Org/Texinfo build artifacts.

This repository uses CI to build manuals and a dedicated release branch strategy:

- source manuals live in `doc/*.org`;
- CI builds `.texi`, `.info`, and `dir` with `scripts/build-manuals.sh`;
- release publishing targets a separate `melpa-release` branch (dry-run workflow currently reports the exact commands only);
- release dry-run steps are gated on a successful full test run.

For `M-x info-display-manual` support in installed packages:

- package contents must include the generated `*.info` files;
- package root must include a `dir` file so package activation can add the directory to `Info-directory-list`.

* Tests

#+begin_src sh
emacs -Q --batch -L . -L test \
  -l test/looking-glass-test.el \
  -f ert-run-tests-batch-and-exit
#+end_src
